results/out/jetty.ring-middleware.sync.java17.ZGC.r10k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 2.852ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 1.630ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.795ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 1.697ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.696ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.781ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.927ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 23.578ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 2.760ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.632ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 6.985ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.622ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.835ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 44.749ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 28.062ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 6.608ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.19ms   12.10ms   1.00s    99.89%
    Req/Sec   657.28    704.37     3.09k    81.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.11ms
 75.000%    4.11ms
 90.000%    6.43ms
 99.000%   10.26ms
 99.900%   15.60ms
 99.990%  766.97ms
 99.999%  976.90ms
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.072     0.000000            1         1.00
       0.867     0.100000       591277         1.11
       1.170     0.200000      1181139         1.25
       1.430     0.300000      1769931         1.43
       1.723     0.400000      2360161         1.67
       2.107     0.500000      2950943         2.00
       2.363     0.550000      3244707         2.22
       2.681     0.600000      3540298         2.50
       3.077     0.650000      3835081         2.86
       3.555     0.700000      4129125         3.33
       4.115     0.750000      4425223         4.00
       4.423     0.775000      4572379         4.44
       4.755     0.800000      4719839         5.00
       5.115     0.825000      4867917         5.71
       5.499     0.850000      5014106         6.67
       5.931     0.875000      5161567         8.00
       6.171     0.887500      5235349         8.89
       6.431     0.900000      5309792        10.00
       6.707     0.912500      5382791        11.43
       7.023     0.925000      5456537        13.33
       7.387     0.937500      5530239        16.00
       7.595     0.943750      5567309        17.78
       7.811     0.950000      5603779        20.00
       8.055     0.956250      5640904        22.86
       8.327     0.962500      5677588        26.67
       8.639     0.968750      5714427        32.00
       8.815     0.971875      5733385        35.56
       8.999     0.975000      5751588        40.00
       9.199     0.978125      5769927        45.71
       9.423     0.981250      5788479        53.33
       9.671     0.984375      5806716        64.00
       9.815     0.985938      5816194        71.11
       9.967     0.987500      5825209        80.00
      10.143     0.989062      5834557        91.43
      10.343     0.990625      5843639       106.67
      10.575     0.992188      5852677       128.00
      10.719     0.992969      5857353       142.22
      10.887     0.993750      5861956       160.00
      11.087     0.994531      5866497       182.86
      11.343     0.995313      5871132       213.33
      11.663     0.996094      5875690       256.00
      11.855     0.996484      5877967       284.44
      12.103     0.996875      5880247       320.00
      12.415     0.997266      5882558       365.71
      12.847     0.997656      5884843       426.67
      13.407     0.998047      5887160       512.00
      13.735     0.998242      5888306       568.89
      14.143     0.998437      5889461       640.00
      14.607     0.998633      5890618       731.43
      15.103     0.998828      5891753       853.33
      15.679     0.999023      5892914      1024.00
      16.047     0.999121      5893484      1137.78
      16.511     0.999219      5894074      1280.00
      17.183     0.999316      5894644      1462.86
      18.271     0.999414      5895212      1706.67
      19.967     0.999512      5895783      2048.00
      22.687     0.999561      5896070      2275.56
      82.751     0.999609      5896357      2560.00
     196.223     0.999658      5896645      2925.71
     313.599     0.999707      5896934      3413.33
     423.935     0.999756      5897221      4096.00
     485.119     0.999780      5897365      4551.11
     542.207     0.999805      5897509      5120.00
     599.039     0.999829      5897653      5851.43
     656.383     0.999854      5897800      6826.67
     716.287     0.999878      5897942      8192.00
     742.911     0.999890      5898017      9102.22
     771.583     0.999902      5898085     10240.00
     802.815     0.999915      5898161     11702.86
     827.903     0.999927      5898229     13653.33
     857.599     0.999939      5898303     16384.00
     874.495     0.999945      5898337     18204.44
     887.295     0.999951      5898375     20480.00
     902.655     0.999957      5898411     23405.71
     918.015     0.999963      5898445     27306.67
     930.815     0.999969      5898482     32768.00
     936.447     0.999973      5898499     36408.89
     943.103     0.999976      5898518     40960.00
     951.295     0.999979      5898536     46811.43
     959.999     0.999982      5898553     54613.33
     966.655     0.999985      5898571     65536.00
     969.215     0.999986      5898580     72817.78
     972.287     0.999988      5898590     81920.00
     975.871     0.999989      5898600     93622.86
     981.503     0.999991      5898607    109226.67
     983.039     0.999992      5898618    131072.00
     984.575     0.999993      5898621    145635.56
     987.135     0.999994      5898625    163840.00
     992.767     0.999995      5898633    187245.71
     994.815     0.999995      5898636    218453.33
     995.839     0.999996      5898640    262144.00
     996.351     0.999997      5898641    291271.11
     997.375     0.999997      5898643    327680.00
    1000.959     0.999997      5898647    374491.43
    1001.983     0.999998      5898648    436906.67
    1003.519     0.999998      5898652    524288.00
    1003.519     0.999998      5898652    582542.22
    1003.519     0.999998      5898652    655360.00
    1004.031     0.999999      5898654    748982.86
    1004.543     0.999999      5898655    873813.33
    1005.055     0.999999      5898661   1048576.00
    1005.055     1.000000      5898661          inf
#[Mean    =        3.189, StdDeviation   =       12.102]
#[Max     =     1004.544, Total count    =      5898661]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5996498 requests in 10.00m, 0.93GB read
Requests/sec:   9994.10
Transfer/sec:      1.58MB