results/out/undertow.ring-middleware.sync.java15.ShenandoahGC.r30k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 1.002ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.024ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.967ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.037ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.019ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.010ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.003ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.981ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.964ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.986ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.995ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.986ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.995ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.061ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01ms    1.43ms 130.24ms   98.66%
    Req/Sec     1.98k   365.15     6.80k    72.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.91ms
 75.000%    1.23ms
 90.000%    1.57ms
 99.000%    2.87ms
 99.900%   14.37ms
 99.990%   68.86ms
 99.999%  102.97ms
100.000%  130.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.059     0.000000            4         1.00
       0.342     0.100000      1778164         1.11
       0.504     0.200000      3549323         1.25
       0.648     0.300000      5320550         1.43
       0.781     0.400000      7090177         1.67
       0.908     0.500000      8861347         2.00
       0.970     0.550000      9734748         2.22
       1.033     0.600000     10617988         2.50
       1.097     0.650000     11509981         2.86
       1.162     0.700000     12395969         3.33
       1.233     0.750000     13277120         4.00
       1.273     0.775000     13720789         4.44
       1.317     0.800000     14159814         5.00
       1.367     0.825000     14606984         5.71
       1.423     0.850000     15048480         6.67
       1.488     0.875000     15489121         8.00
       1.525     0.887500     15708507         8.89
       1.566     0.900000     15927923        10.00
       1.612     0.912500     16148570        11.43
       1.664     0.925000     16370326        13.33
       1.724     0.937500     16592640        16.00
       1.758     0.943750     16701767        17.78
       1.796     0.950000     16811568        20.00
       1.841     0.956250     16923208        22.86
       1.894     0.962500     17033556        26.67
       1.960     0.968750     17144694        32.00
       1.999     0.971875     17198574        35.56
       2.047     0.975000     17254444        40.00
       2.107     0.978125     17309961        45.71
       2.187     0.981250     17364641        53.33
       2.307     0.984375     17420485        64.00
       2.393     0.985938     17447812        71.11
       2.515     0.987500     17475443        80.00
       2.699     0.989062     17502935        91.43
       3.025     0.990625     17530424       106.67
       3.703     0.992188     17558031       128.00
       4.239     0.992969     17571852       142.22
       4.863     0.993750     17585683       160.00
       5.587     0.994531     17599503       182.86
       6.351     0.995313     17613325       213.33
       7.055     0.996094     17627172       256.00
       7.471     0.996484     17634093       284.44
       8.031     0.996875     17640980       320.00
       8.703     0.997266     17647887       365.71
       9.567     0.997656     17654836       426.67
      10.415     0.998047     17661717       512.00
      10.831     0.998242     17665212       568.89
      11.255     0.998437     17668664       640.00
      11.871     0.998633     17672085       731.43
      12.935     0.998828     17675542       853.33
      14.567     0.999023     17679003      1024.00
      15.351     0.999121     17680728      1137.78
      16.223     0.999219     17682454      1280.00
      17.359     0.999316     17684177      1462.86
      19.375     0.999414     17685913      1706.67
      23.231     0.999512     17687634      2048.00
      25.743     0.999561     17688498      2275.56
      29.311     0.999609     17689362      2560.00
      33.727     0.999658     17690226      2925.71
      39.135     0.999707     17691090      3413.33
      45.375     0.999756     17691956      4096.00
      48.479     0.999780     17692387      4551.11
      51.071     0.999805     17692816      5120.00
      54.591     0.999829     17693248      5851.43
      58.495     0.999854     17693679      6826.67
      63.647     0.999878     17694113      8192.00
      66.303     0.999890     17694328      9102.22
      69.311     0.999902     17694547     10240.00
      72.191     0.999915     17694761     11702.86
      75.327     0.999927     17694981     13653.33
      78.143     0.999939     17695192     16384.00
      79.807     0.999945     17695304     18204.44
      81.407     0.999951     17695407     20480.00
      82.879     0.999957     17695515     23405.71
      84.479     0.999963     17695623     27306.67
      87.167     0.999969     17695731     32768.00
      89.023     0.999973     17695789     36408.89
      91.263     0.999976     17695839     40960.00
      94.335     0.999979     17695895     46811.43
      97.023     0.999982     17695947     54613.33
      99.327     0.999985     17696002     65536.00
     100.351     0.999986     17696028     72817.78
     100.991     0.999988     17696055     81920.00
     102.271     0.999989     17696082     93622.86
     103.359     0.999991     17696109    109226.67
     105.215     0.999992     17696138    131072.00
     106.239     0.999993     17696151    145635.56
     107.327     0.999994     17696164    163840.00
     108.031     0.999995     17696177    187245.71
     109.247     0.999995     17696190    218453.33
     110.591     0.999996     17696205    262144.00
     111.167     0.999997     17696211    291271.11
     112.127     0.999997     17696217    327680.00
     112.959     0.999997     17696227    374491.43
     113.151     0.999998     17696231    436906.67
     113.983     0.999998     17696238    524288.00
     114.303     0.999998     17696241    582542.22
     114.559     0.999998     17696244    655360.00
     115.263     0.999999     17696248    748982.86
     118.783     0.999999     17696251    873813.33
     122.303     0.999999     17696255   1048576.00
     123.711     0.999999     17696256   1165084.44
     125.311     0.999999     17696258   1310720.00
     126.079     0.999999     17696262   1497965.71
     126.079     0.999999     17696262   1747626.67
     126.847     1.000000     17696263   2097152.00
     126.911     1.000000     17696264   2330168.89
     127.295     1.000000     17696265   2621440.00
     127.359     1.000000     17696266   2995931.43
     127.359     1.000000     17696266   3495253.33
     127.615     1.000000     17696267   4194304.00
     127.999     1.000000     17696268   4660337.78
     127.999     1.000000     17696268   5242880.00
     128.319     1.000000     17696269   5991862.86
     128.319     1.000000     17696269   6990506.67
     128.319     1.000000     17696269   8388608.00
     129.279     1.000000     17696270   9320675.55
     129.279     1.000000     17696270  10485760.00
     129.279     1.000000     17696270  11983725.71
     129.279     1.000000     17696270  13981013.34
     129.279     1.000000     17696270  16777216.00
     130.303     1.000000     17696271  18641351.10
     130.303     1.000000     17696271          inf
#[Mean    =        1.007, StdDeviation   =        1.433]
#[Max     =      130.240, Total count    =     17696271]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17998254 requests in 10.00m, 2.65GB read
Requests/sec:  29997.11
Transfer/sec:      4.52MB